{"title":"Google", "body":"When people think of search engines, the first name that comes to mind is often Google.", "url":"https://www.google.com"}
{"title":"Bing", "body":"Based on comScore’s data, the next most powerful player in the search engine industry is Microsoft and its search engine, Bing.", "url":"https://www.bing.com"}
{"title":"Yahoo", "body":"Another powerful competitor in the search engine market is the long-enduring Yahoo.", "url":"https://www.yahoo.com"}
{"title":"Yandex", "body":"Founded in Russia in 1997, Yandex has quickly risen to become the country’s premier search engine.", "url":"https://www.yandex.com"}
{"title":"Ask", "body":"The search engine formerly known as \"Ask Jeeves\" was easily one of Google’s greatest competitors during the early days of the World Wide Web.", "url":"https://www.ask.com"}
{"title":"Dogpile", "body":"For those unsure of which search engine to use, many default to Dogpile -- the engine that aggregates from pretty much everyone else.", "url":"https://www.dogpile.com"}
{"title":"Yippy", "body":"Many Internet users are unfamiliar with the Deep Web.", "url":"https://www.yippy.com"}
{"title":"Duck Duck Go", "body":"With a name based on the popular kids’ game Duck Duck Goose, Duck Duck Go is a website that many find as approachable, user-friendly, and engaging as the game. Duck Duck Go’s first priority is protecting user privacy.", "url":"https://www.duckduckgo.com"}
{"title":"EntireWeb", "body":"First launched back in 2000, EntireWeb is a search engine that requires pages to submit their websites to it for free.", "url":"https://www.entireweb.com"}
{"title":"Blekko", "body":"Created just a few years ago in 2010, blekko (with a stylized lowercase \"b\") is the search engine clearly inspired by Twitter.", "url":"https://www.blekko.com"}
{"title":"Goodsearch", "body":"Goodsearch is a search engine for the charitable. Fueled by Yahoo, Goodsearch allows users to pick a cause of their choice; this can be a nonprofit organization or school.", "url":"https://www.goodsearch.com"}
{"title":"GigaBlast", "body":"Another search engine boasting enormous social and trust capital is GigaBlast.","url":"https://www.gigablast.com"}
{"title":"Baidu", "body":"Though a relative unknown in the United States, Chinese search engine Baidu is a juggernaut on the international scene.", "url":"https://www.baidu.com"}
